package One_JavaSyntax.task.task_2.task_06;

/*
 * Кусочек калькулятора
 * Объявить 2 переменные a, b (int)
 * Присвоить любые значения
 * Вывести их сумму и произведение на экран. (с новой строки)
 */

public class Solution {
    public static void main(String[] args) {
        int a = 5;
        int b = 10;
        System.out.println(a + b);
        System.out.println(a * b);

    }
}
