package One_JavaSyntax.task.task_6.task_018;

 /*
 * KissMyShinyMetalAss
 * Создайте класс с именем KissMyShinyMetalAss
 * Создайте объект этого класса, выведи его на экран
 */

public class Solution {
    public static class KissMyShinyMetalAss {
    }

    public static void main(String[] args) {
        //напишите тут ваш код
        KissMyShinyMetalAss kmsma = new KissMyShinyMetalAss();
        System.out.println(kmsma);
    }
}
