package One_JavaSyntax.task.task_1.task_02;

 /*
 * На нашем экране переменная.
 * Объявить переменную name (String)
 * Присвоить значение
 * Вывести на экран
 * */


public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        String name = "Brittany_Miller";
        System.out.println(name);

    }
}
